[
  {
    "id": 1,
    "title": "كِتَابُ الْإِيمَانِ وَالْإِسْلَامِ وَالْقَدَرِ وَالشَّفَاعَةِ",
    "content": [
      "وَفِيهِ تِسْعَةٌ وَعِشْرُونَ حَدِيثًا تُبَيِّنُ أَسَاسَاتِ الْإِيمَانِ وَمَا يَجِبُ عَلَى الْمُؤْمِنِ مِنَ الْعَقَائِدِ وَالْأَرْكَانِ.",
      "عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ يَحْيَى بْنِ يَعْمُرَ، أَنَّهُ قَالَ: بَيْنَمَا كُنْتُ مَعَ صَاحِبٍ لِي فِي مَدِينَةِ رَسُولِ اللَّهِ ﷺ، فَصَادَفْنَا عَبْدَ اللَّهِ بْنِ عُمَرَ، فَسَأَلْتُهُ عَنْ الْقَدَرِ، فَأَجَابَنِي بِكَلِمَاتٍ تَحْمِلُ الْحِكْمَةَ وَالْوُضُوحَ.",
      "فِي حَدِيثٍ آخَرَ، وَصَفَ النَّبِيُّ ﷺ شَابًّا جَمِيلًا بِيضَاءَ اللَّمَّةِ، جَاءَ يُسْأِلُهُ عَنِ الْإِيمَانِ وَالشَّرَائِعِ وَالإحسانِ، فَكَانَتْ أَجْوِبَتُهُ بَيِّنةً وَمُفَصَّلَةً، تُعْلِمُ النَّاسَ مَا يَجِبُ عَلَيْهِمْ مِنَ الْعَمَلِ وَالإِيمَانِ.",
      "يَأْتِي فِي الْحَدِيثِ أَيْضًا تَحْذِيرٌ مِنَ الْمُكْفِرِينَ وَمَنِ انْحَرَفُوا عَنِ الطَّرِيقِ الْمُسْتَقِيمِ، وَتَذْكِيرٌ بِلُزُومِ أَصْحَابِ الرَّسُولِ ﷺ وَالثَّبَاتِ عَلَى السُّنَّةِ."
    ],
    "footnotes": [
      {
        "text": "حديث رقم 1 من كتاب الإيمان",
        "reference": "مسند أبي حنيفة"
      }
    ]
  },
  {
    "id": 2,
    "title": "كِتَابُ الصَّلَاةِ وَالصِّيَامِ",
    "content": [
      "الصلاة ركن أساسي من أركان الإسلام، وهي عمود الدين، فَفِيهَا يُثْبَتُ الإيمانُ وَتُتَقوَى النُّفُوسُ، ويفرض الله تعالى خمس صلوات في اليوم والليلة.",
      "الصيام في شهر رمضان من العبادات العظيمة التي تهذب النفس وتزيد التقوى، وشرع الله هذا الركن ليكون اختبارًا للصبر والطاعة.",
      "تَحْتَوي الأحاديث في هذا الكتاب على تفصيل صفة الصلاة الصحيحة، ومواقيت الصيام وشروطه، بالإضافة إلى ما يبطل كلًا منهما، وكيفية الاعتداد بالأحاديث النبوية في فهم هذه العبادات."
    ],
    "footnotes": [
      {
        "text": "شرح الصلاة في الفقه الإسلامي",
        "reference": "الفتح الرباني"
      }
    ]
  },
  {
    "id": 3,
    "title": "كِتَابُ الزَّكَاةِ وَالْفَضْلِ",
    "content": [
      "الزكاة حق على كل مسلم قادر ماليًا، وهي تطهير للمال والنفس، وتزيد البركة في الرزق، وتدفع الفقر عن المجتمع.",
      "في هذا الكتاب أحاديث تحث على إخراج الزكاة في وقتها، وبيان من يستحقها من الفقراء والمحتاجين.",
      "تُذَكَّرُ الأحاديث بأهمية الصدقة والفضل في حياة المسلم، وأثرها على المجتمع من حيث التكافل والتراحم."
    ],
    "footnotes": []
  },
  {
    "id": 4,
    "title": "كِتَابُ الْحَجِّ وَالْعُمْرَةِ",
    "content": [
      "الحج فريضة عظيمة فرضها الله على من استطاع إليه سبيلا مرة واحدة في العمر، وهو ركن من أركان الإسلام.",
      "الكتاب يبين خطوات أداء مناسك الحج والعمرة وأهميتها، والسنن التي يجب اتباعها لتأدية الحج بالشكل الصحيح.",
      "تتضمن الأحاديث وصف النبي ﷺ وهو يؤدي مناسك الحج، وتعليماته للمسلمين في كيفية إتمام هذه الفريضة."
    ],
    "footnotes": []
  },
  {
    "id": 5,
    "title": "كِتَابُ الْجِهَادِ وَالْقِتَالِ",
    "content": [
      "الجهاد في سبيل الله عبادة جليلة فرضها الله للدفاع عن الدين والأرض والمجتمع الإسلامي.",
      "الكتاب يتناول تعريف الجهاد، وأنواعه، وأحكامه، والحدود التي يجب الالتزام بها أثناء القتال.",
      "يُوضِّحُ الحديث فضل الشهداء في سبيل الله وكيف أن دماءهم طاهرة وأجورهم عظيمة عند الله."
    ],
    "footnotes": []
  },
  {
    "id": 6,
    "title": "كِتَابُ الْوَقْتِ وَالْأَعْمَالِ",
    "content": [
      "أهمية الوقت في حياة المسلم لا تضاهى، فهو رأس مال لا يُعوَّض، ولذا حث الإسلام على حسن استغلاله.",
      "الكتاب يشرح الأعمال الصالحة التي يُستحب القيام بها في أوقات محددة مثل الصلوات والعبادات المختلفة.",
      "يحتوي على أحاديث نبوية توضح فضل العمل الصالح وأثره في رفع الدرجات عند الله."
    ],
    "footnotes": []
  },
  {
    "id": 7,
    "title": "كِتَابُ الْأَدْعِيَةِ وَالْذِّكْرِ",
    "content": [
      "مجموعة من الأدعية المأثورة التي تقرب العبد من ربه وتثبت قلبه في مواجهة الابتلاءات.",
      "تُبرز أهمية الذكر في حياة المسلم ودوره في تطهير القلب وراحة النفس.",
      "تتضمن الأحاديث فضل الاستغفار وذكر الله في جميع الأحوال."
    ],
    "footnotes": []
  },
  {
    "id": 8,
    "title": "كِتَابُ الْأَخْلَاقِ وَالْآدَابِ",
    "content": [
      "الحديث عن الأخلاق الإسلامية التي ينبغي أن يتحلى بها كل مسلم، كالصدق، والأمانة، والعدل.",
      "شرح آداب التعامل مع الناس وأهمية احترام الكبير والرحمة بالصغير.",
      "أحاديث النبي ﷺ التي تحث على التحلي بأفضل الصفات وتجنب السيئات."
    ],
    "footnotes": []
  },
  {
    "id": 9,
    "title": "كِتَابُ النَّبِيِّ وَأَهْلِ بَيْتِهِ",
    "content": [
      "سيرة النبي محمد ﷺ، والصفات التي تميزه، وأخلاقه الرفيعة.",
      "قصص عن أهل بيته الكرام، وأدوارهم في الدعوة والدفاع عن الإسلام.",
      "أحاديث تتحدث عن فضائل أهل البيت وأهميتهم في الأمة."
    ],
    "footnotes": []
  },
  {
    "id": 10,
    "title": "كِتَابُ الْعِلْمِ وَالْفَهْمِ",
    "content": [
      "فضل العلم في الإسلام وكيف أنه باب لكل خير وسبب في رفعة الإنسان.",
      "طرق طلب العلم، وأهمية التفقه في الدين والعلم الشرعي.",
      "أحاديث تحث على السعي في طلب العلم وتبيّن منزلة العلماء."
    ],
    "footnotes": []
  },
  {
    "id": 11,
    "title": "كِتَابُ الْحِكْمَةِ وَالْفَصَاحَةِ",
    "content": [
      "أهمية الحكمة في التعامل مع الناس وحل المشاكل.",
      "البلاغة في الكلام وأثرها في الدعوة والتوجيه.",
      "أحاديث تتحدث عن تأثير الكلام الطيب وحسن التعبير."
    ],
    "footnotes": []
  },
  {
    "id": 12,
    "title": "كِتَابُ الرِّجَالِ وَالْأَصْحَابِ",
    "content": [
      "تعريف الصحابة وفضائلهم وأدوارهم في نشر الإسلام.",
      "قصص عن تضحيات الصحابة في سبيل الله.",
      "الأحاديث التي تثني على الصحابة وتحث على محبتهم."
    ],
    "footnotes": []
  },
  {
    "id": 13,
    "title": "كِتَابُ الْحَيَاةِ بَعْدَ الْمَوْتِ",
    "content": [
      "شرح مفصل عن البعث والقيامة وأهوالها.",
      "وصف الجنة والنار وأعمال تؤدي إلى كل منهما.",
      "أحاديث تحذر من الغفلة عن الآخرة وأهمية الاستعداد لها."
    ],
    "footnotes": []
  },
  {
    "id": 14,
    "title": "كِتَابُ الْعِبَادَةِ وَالْقُرْآنِ",
    "content": [
      "فضل قراءة القرآن وتأمل آياته.",
      "شرح العبادات وأهميتها في حياة المسلم.",
      "أحاديث تتحدث عن مكانة القرآن وفضل التلاوة."
    ],
    "footnotes": []
  },
  {
    "id": 15,
    "title": "كِتَابُ الْحُرُمَاتِ وَالْحَدُودِ",
    "content": [
      "أهمية احترام الحرمات في الإسلام.",
      "الحدود التي وضعها الشرع للحفاظ على المجتمع.",
      "أحاديث تحذر من انتهاك هذه الحرمات وبيان عواقب ذلك."
    ],
    "footnotes": []
  },
  {
    "id": 16,
    "title": "كِتَابُ الْأَسْرَارِ وَالْغَيْبِ",
    "content": [
      "شرح لبعض الغيبيات التي أخبرنا بها النبي ﷺ.",
      "الأسرار التي يعلمها الله وحده.",
      "أحاديث تتحدث عن الغيب وأثر الإيمان به على القلوب."
    ],
    "footnotes": []
  },
  {
    "id": 17,
    "title": "كِتَابُ الْمُعَامَلَاتِ وَالْعُقُودِ",
    "content": [
      "أحكام البيع والشراء والتجارة في الإسلام.",
      "العقود التي تنظم العلاقات المالية بين الناس.",
      "أحاديث عن الأمانة والصدق في المعاملات."
    ],
    "footnotes": []
  },
  {
    "id": 18,
    "title": "كِتَابُ الْمَوَاطِنِ وَالْأَرَاضِي",
    "content": [
      "الحقوق والواجبات المتعلقة بالأراضي والممتلكات.",
      "أحكام الزكاة على الأرض والعقارات.",
      "أحاديث تبرز أهمية حفظ الحقوق وعدم الاعتداء."
    ],
    "footnotes": []
  },
  {
    "id": 19,
    "title": "كِتَابُ الْأَحْكَامِ الشَّرْعِيَّةِ",
    "content": [
      "تفصيل لأحكام الشريعة في مختلف المجالات.",
      "القصاص والحدود وأحكام العبادات.",
      "أحاديث نبوية توضح كيفية تطبيق الأحكام."
    ],
    "footnotes": []
  },
  {
    "id": 20,
    "title": "كِتَابُ الْوَصَايَا وَالْمَوَاصِي",
    "content": [
      "وصايا النبي ﷺ لأصحابه والمجتمع الإسلامي.",
      "المواعظ والنصائح التي تهدي النفوس إلى الخير.",
      "أحاديث في فضائل الأخلاق والتسامح."
    ],
    "footnotes": []
  }
]
